<template>
  <div>
    <div class="collab-content numbered-section">
      <div class="collab-description">
        <p>
          89bet 技术上与 BBIN
          合作，成为哥斯达黎加合法注册的游戏公司。我们采用最多样化、最先进、最公平的制度。
          在众多游戏网站中，我们很自豪能够为我们的会员提供最有利的反馈，并为经销商创造强大的利润优势！
          89bet 秉承共同创业、资源整合、利益共享的理念，我们将与合作伙伴携手共进，共创繁荣。
          无论您拥有什么样的网络资源或丰富的人脉，都欢迎您加入我们，您可以在不产生任何费用的情况下开启无限的收入。
          89bet 娱乐绝对是您最明智的选择！
        </p>

        <h3>我, 经销商注册协议</h3>
        <p>
          为了防止不法运营商滥用 89bet
          所提供的经销商折扣系统，我们将仔细审查每个代理商在注册时提供的个人信息（包括姓名、IP、地址、电子邮件地址、电话号码、
          付款方式等）。如果审计发现经销商有任何不正当的盈利行为或与其他经销商和会员串通， 89bet
          娱乐公司将关闭合作公司的账户，扣除账户中的本金等。 并从代理商那里收回所有佣金和折扣。同
          IP/同名/同集合账号的会员只能是合作代理的下线，代理本身不能成为代理的下线成员。
        </p>

        <!-- Number sec 1-->
        <h3>一、权利和责任条款</h3>
        <!-- 1 -->
        <h2>联盟伙伴的权利 89bet 和义务</h2>
        <p>
          公司的 89bet
          客户服务部门将对联盟的线下会员进行登记，并观察他们的投注状态。代理商和会员必须同意并遵守会员规定、政策和作程序。89bet
          联盟会员可以随时登录管理界面，查看投注状态和离线会员活动的概览。 89bet
          保留拒绝或冻结关联公司或合作会员账户的权利。 89bet
          保留修改合同任何条款（包括：当前佣金范围、佣金计划、支付程序和推荐计划规定等）的权利，
          89bet
          本公司应通过电子邮件、网站通知等方式通知合作代理人。经销商如不同意任何修改，可选择终止合同或联系客服人员征求意见。如果代表不反对，则视为修改后的违约合同，变更后必须遵守相关规定。
        </p>
        <!-- 2 -->
        <h2>联盟合作伙伴的权利和义务 89bet</h2>
        <p>
          为了防止不法运营商滥用 89bet
          所提供的经销商折扣系统，我们将仔细审查每个代理商在注册时提供的个人信息
          （包括姓名、IP、地址、电子邮件地址、电话号码、付款方式等）。如果审计发现经销商有任何不正当的盈利行为或与其他经销商和会员串通，
          89bet 娱乐公司将关闭合作公司的账户，扣除账户中的本金等。并从代理商那里收回所有佣金和折扣。
          同 IP/同名/同集合账号的会员只能是合作代理的下线，代理本身不能成为代理的下线成员。
        </p>
        <!-- Number sec 2-->
        <h3>二、不同的规则</h3>
        <!-- 1 -->
        <p>
          各级合作经销商未经 许可，不能开设双/多代理账号， 89bet 也不能从 89bet
          游戏账号或其他有权获得佣金的利益相关者开立双/多代理账号。请记住，任何经销商都不能使用联盟帐户下注。
          89bet 保留终止和封存帐户和游戏中赚取的所有佣金的权利。
        </p>
        <p>
          为确保所有会员 89bet 的帐户隐私和权益， 89bet
          不会提供任何会员密码，或会员的个人信息。各级合作代理也不允许以任何方式获取会员资料，或自行登录下属会员账号。如果发现联盟会员侵犯了会员
          89bet 的隐私， 89bet 保留取消联盟会员奖励和取消联盟会员帐户的权利。
        </p>
        <p>
          合作机构的成员不得开设多个账户。 89bet
          有权要求会员提供有效身份证件以验证会员身份，并保留判断会员是否多次注册 IP
          的权利。如果您违反上述问题， 89bet 有权终止玩家的游戏并封存该帐户和游戏中赚取的所有佣金。
        </p>
        <p>
          如果联盟会员因违反规则而被禁止使用游戏 89bet 或 89bet 将存款退还给会员， 89bet
          则不会向联盟会员分配相应的佣金。如果合作代理成员用于保证金的信用卡和信息库受到审查， 89bet
          相关佣金将被扣留，直到审查完成。
        </p>
        <p>
          合同条件将在正式接受合作代理商的参与后 89bet 生效。 89bet
          娱乐公司和代理人可以随时终止本合同。在任何情况下，如果代理人希望终止合同，则必须在改进后 7
          天内以书面/电子邮件通知 89bet 。经销商活动将每 3
          个月审查一次。如果联盟会员不再是与会员的现有合作社，则本合同可能随时终止。如果代理人违反合同规定，
          89bet 其保留立即终止合同的权利。
        </p>
        <p>
          未经 许可89bet，代理商不能披露和授权 89bet
          相关保密信息，包括代理商收到的反馈、佣金报告、方法计算等;合同终止后，代理人有义务保管机密文件和机密数据。合同终止后，代理人
          89bet 将无需行使双方的权利和义务。合同的终止并不能免除代理人在终止合同之前必须履行的义务。
        </p>
      </div>
    </div>
  </div>
</template>

<script setup></script>

<style scoped>
.collab-container {
  width: 1200px;
  border-radius: 10px;
}

.collab-description h3,
.collab-description h2 {
  color: #fff;
  font-size: 16px;
  margin-top: 20px;
  margin-bottom: 10px;
}

.collab-description h3 {
  font-weight: bold;
}

.collab-description p {
  font-size: 14px;
  margin: 1em 0;
  color: #fff;
  line-height: 2em;
}

/* ✨ 自动编号 h2 样式 */
.numbered-section {
  counter-reset: h2-counter;
}

.numbered-section h2 {
  counter-increment: h2-counter;
  position: relative;
  padding-left: 28px;
  font-weight: normal;
}

.numbered-section h2::before {
  content: counter(h2-counter) '. ';
  position: absolute;
  left: 0;
  color: #fff;
}
</style>
